alexrayne/uos-embedded/sources/runtime/cortex-m/io-stm32f2.h
/*
 * Register definitions for STM32F2xx.
 *
 * Copyright (C) 2013-2018 Dmitry Podkhvatilin, <vatilin@gmail.com>
 *
 * This file is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * You can redistribute this file and/or modify it under the terms of the GNU
 * General Public License (GPL) as published by the Free Software Foundation;
 * either version 2 of the License, or (at your discretion) any later version.
 * See the accompanying file "COPYING.txt" for more details.
 *
 * As a special exception to the GPL, permission is granted for additional
 * uses of the text contained in this file.  See the accompanying file
 * "COPY-UOS.txt" for details.
 */
typedef volatile unsigned int arm_reg_t;

#ifndef AHB_DIV
#   define AHB_DIV     1
#endif

#ifndef APB1_DIV
#   define APB1_DIV    4
#endif

#ifndef APB2_DIV
#   define APB2_DIV    2
#endif


#define ARM_SRAM_BASE       0x20000000  // Internal static memory
#define ARM_PERIPH_BASE     0x40000000  // Peripheral registers
#define ARM_SYSTEM_BASE     0xE0000000  // Core registers

#define ARM_SRAM_SIZE       (192*1024)   // Internal SRAM size

#include <runtime/cortex-m/io-cortex-m.h>

//
// Peripheral memory map
//
#define STM_TIM2_BASE           0x40000000
#define STM_TIM3_BASE           0x40000400
#define STM_TIM4_BASE           0x40000800
#define STM_TIM5_BASE           0x40000C00
#define STM_TIM6_BASE           0x40001000
#define STM_TIM7_BASE           0x40001400
#define STM_TIM12_BASE          0x40001800
#define STM_TIM13_BASE          0x40001C00
#define STM_TIM14_BASE          0x40002000
#define STM_RTC_BKP_BASE        0x40002800
#define STM_WWDG_BASE           0x40002C00
#define STM_IWDG_BASE           0x40003000
#define STM_SPI2_I2S2_BASE      0x40003800
#define STM_SPI3_I2S3_BASE      0x40003C00
#define STM_USART2_BASE         0x40004400
#define STM_USART3_BASE         0x40004800
#define STM_UART4_BASE          0x40004C00
#define STM_UART5_BASE          0x40005000
#define STM_I2C1_BASE           0x40005400
#define STM_I2C2_BASE           0x40005800
#define STM_I2C3_BASE           0x40005C00
#define STM_CAN1_BASE           0x40006400
#define STM_CAN2_BASE           0x40006800
#define STM_PWR_BASE            0x40007000
#define STM_DAC_BASE            0x40007400
#define STM_TIM1_BASE           0x40010000
#define STM_TIM8_BASE           0x40010400
#define STM_USART1_BASE         0x40011000
#define STM_USART6_BASE         0x40011400
#define STM_ADC1_BASE           0x40012000
#define STM_ADC2_BASE           0x40012100
#define STM_ADC3_BASE           0x40012200
#define STM_ADC_COM_BASE        0x40012300
#define STM_SDIO_BASE           0x40012C00
#define STM_SPI1_BASE           0x40013000
#define STM_SYSCFG_BASE         0x40013800
#define STM_EXTI_BASE           0x40013C00
#define STM_TIM9_BASE           0x40014000
#define STM_TIM10_BASE          0x40014400
#define STM_TIM11_BASE          0x40014800
#define STM_GPIOA_BASE          0x40020000
#define STM_GPIOB_BASE          0x40020400
#define STM_GPIOC_BASE          0x40020800
#define STM_GPIOD_BASE          0x40020C00
#define STM_GPIOE_BASE          0x40021000
#define STM_GPIOF_BASE          0x40021400
#define STM_GPIOG_BASE          0x40021800
#define STM_GPIOH_BASE          0x40021C00
#define STM_GPIOI_BASE          0x40022000
#define STM_CRC_BASE            0x40023000
#define STM_RCC_BASE            0x40023800
#define STM_FLASH_IFACE_BASE    0x40023C00
#define STM_BKPSRAM_BASE        0x40024000
#define STM_DMA1_BASE           0x40026000
#define STM_DMA2_BASE           0x40026400
#define STM_ETH_BASE            0x40028000
#define STM_USB_OTG_HS_BASE     0x40040000
#define STM_USB_OTG_FS_BASE     0x50000000
#define STM_DCMI_BASE           0x50050000
#define STM_CRYP_BASE           0x50060000
#define STM_HASH_BASE           0x50060400
#define STM_RNG_BASE            0x50060800
#define STM_FSMC_BASE           0xA0000000


typedef enum
{
    IRQ_WWDG,
    IRQ_PVD,
    IRQ_TAMPER_STAMP,
    IRQ_RTC_WKUP,
    IRQ_FLASH,
    IRQ_RCC,
    IRQ_EXTI0,
    IRQ_EXTI1,
    IRQ_EXTI2,
    IRQ_EXTI3,
    IRQ_EXTI4,
    IRQ_DMA1_STREAM0,
    IRQ_DMA1_STREAM1,
    IRQ_DMA1_STREAM2,
    IRQ_DMA1_STREAM3,
    IRQ_DMA1_STREAM4,
    IRQ_DMA1_STREAM5,
    IRQ_DMA1_STREAM6,
    IRQ_ADC,
    IRQ_CAN1_TX,
    IRQ_CAN1_RX0,
    IRQ_CAN1_RX1,
    IRQ_CAN1_SCE,
    IRQ_EXTI9_5,
    IRQ_TIM1_BRK_TIM9,
    IRQ_TIM1_UP_TIM10,
    IRQ_TIM1_TRG_COM_TIM11,
    IRQ_TIM1_CC,
    IRQ_TIM2,
    IRQ_TIM3,
    IRQ_TIM4,
    IRQ_I2C1_EV,
    IRQ_I2C1_ER,
    IRQ_I2C2_EV,
    IRQ_I2C2_ER,
    IRQ_SPI1,
    IRQ_SPI2,
    IRQ_USART1,
    IRQ_USART2,
    IRQ_USART3,
    IRQ_EXTI15_10,
    IRQ_RTC_ALARM,
    IRQ_OTG_FS_WKUP,
    IRQ_TIM8_BRK_TIM12,
    IRQ_TIM8_UP_TIM13,
    IRQ_TIM8_TRG_COM_TIM14,
    IRQ_TIM8_CC,
    IRQ_DMA1_STREAM7,
    IRQ_FSMC,
    IRQ_SDIO,
    IRQ_TIM5,
    IRQ_SPI3,
    IRQ_UART4,
    IRQ_UART5,
    IRQ_TIM6_DAC,
    IRQ_TIM7,
    IRQ_DMA2_STREAM0,
    IRQ_DMA2_STREAM1,
    IRQ_DMA2_STREAM2,
    IRQ_DMA2_STREAM3,
    IRQ_DMA2_STREAM4,
    IRQ_ETH,
    IRQ_ETH_WKUP,
    IRQ_CAN2_TX,
    IRQ_CAN2_RX0,
    IRQ_CAN2_RX1,
    IRQ_CAN2_SCE,
    IRQ_OTG_FS,
    IRQ_DMA2_STREAM5,
    IRQ_DMA2_STREAM6,
    IRQ_DMA2_STREAM7,
    IRQ_USART6,
    IRQ_I2C3_EV,
    IRQ_I2C3_ER,
    IRQ_HS_EP1_OUT,
    IRQ_HS_EP1_IN,
    IRQ_OTG_HS_WKUP,
    IRQ_OTG_HS,
    IRQ_DCMI,
    IRQ_CRYP,
    IRQ_HASH_RNG,
    ARCH_TIMER_IRQ,
    ARCH_INTERRUPTS
} IRQn_t;


/////////////////////////////////////////
// External interrupt/event controller
/////////////////////////////////////////
typedef struct
{
    arm_reg_t IMR;      // Interrupt mask
    arm_reg_t EMR;      // Event mask
    arm_reg_t RTSR;     // Rising edge trigger selection
    arm_reg_t FTSR;     // Falling edge trigger selection
    arm_reg_t SWIER;    // Software interrupt event
    arm_reg_t PR;       // Pending
} EXTI_t;

#define EXTI     ((EXTI_t *) STM_EXTI_BASE)

// EXTI lines
#define EXTI_GPIO(n)            (1 << (n))
#define EXTI_PVD                (1 << 16)
#define EXTI_RTC_ALARM          (1 << 17)
#define EXTI_USB_OTG_FS_WKUP    (1 << 18)
#define EXTI_USB_ETH_WKUP       (1 << 19)
#define EXTI_USB_OTG_HS_WKUP    (1 << 20)
#define EXTI_RTC_TAMP_TS        (1 << 21)
#define EXTI_RTC_WKUP           (1 << 22)


/////////////////////////////////////////
// Power control
/////////////////////////////////////////
typedef struct
{
    arm_reg_t CR;       // Power control
    arm_reg_t CSR;      // Power control/status
} PWR_t;

#define PWR     ((PWR_t *) STM_PWR_BASE)

