alexrayne/uos-embedded/sources/runtime/cortex-m/io-stm32f2.h
// CR bits
#define PWR_FPDS            (1 << 9)
#define PWR_DBP             (1 << 8)
#define PWR_PLS_2_0         (0 << 5)
#define PWR_PLS_2_1         (1 << 5)
#define PWR_PLS_2_3         (2 << 5)
#define PWR_PLS_2_5         (3 << 5)
#define PWR_PLS_2_6         (4 << 5)
#define PWR_PLS_2_7         (5 << 5)
#define PWR_PLS_2_8         (6 << 5)
#define PWR_PLS_2_9         (7 << 5)
#define PWR_PLS_MASK        (7 << 5)
#define PWR_PVDE            (1 << 4)
#define PWR_CSBF            (1 << 3)
#define PWR_CWUF            (1 << 2)
#define PWR_PDDS            (1 << 1)
#define PWR_LPSD            (1 << 0)

// CSR bits
#define PWR_BRE             (1 << 9)
#define PWR_EWUP            (1 << 8)
#define PWR_BRR             (1 << 3)
#define PWR_PVDO            (1 << 2)
#define PWR_SBF             (1 << 1)
#define PWR_WUF             (1 << 0)


/////////////////////////////////////////
// SYSCFG
/////////////////////////////////////////
typedef struct
{
    arm_reg_t MEMRMP;   // memory remap
    arm_reg_t PMC;      // peripheral mode configuration
    arm_reg_t EXTICR1;  // external interrupt configuration 1
    arm_reg_t EXTICR2;  // external interrupt configuration 2
    arm_reg_t EXTICR3;  // external interrupt configuration 3
    arm_reg_t EXTICR4;  // external interrupt configuration 4
    arm_reg_t CMPCR;    // compensation cell control
} SYSCFG_t;

#define SYSCFG      ((SYSCFG_t*) STM_SYSCFG_BASE)

// SYSCFG_MEMRMP bits
#define SYSCFG_MEM_MAIN_FLASH       (0 << 0)
#define SYSCFG_MEM_SYSTEM_FLASH     (1 << 0)
#define SYSCFG_MEM_FSMC             (2 << 0)
#define SYSCFG_MEM_SRAM             (3 << 0)

// SYSCFG_PMC bits
#define SYSCFG_MII_RMII_SEL         (1 << 23)

// SYSCFG_EXTICRx bits
#define SYSCFG_PA(x)                (0 << (((x) & 3) * 4))
#define SYSCFG_PB(x)                (1 << (((x) & 3) * 4))
#define SYSCFG_PC(x)                (2 << (((x) & 3) * 4))
#define SYSCFG_PD(x)                (3 << (((x) & 3) * 4))
#define SYSCFG_PE(x)                (4 << (((x) & 3) * 4))
#define SYSCFG_PF(x)                (5 << (((x) & 3) * 4))
#define SYSCFG_PG(x)                (6 << (((x) & 3) * 4))
#define SYSCFG_PH(x)                (7 << (((x) & 3) * 4))
#define SYSCFG_PI(x)                (8 << (((x) & 3) * 4))
#define SYSCFG_PJ(x)                (9 << (((x) & 3) * 4))
#define SYSCFG_PK(x)                (10 << (((x) & 3) * 4))
#define SYSCFG_PMASK(x)             (0xF << (((x) & 3) * 4))

// SYSCFG_CMPCR bits
#define SYSCFG_READY                (1 << 8)
#define SYSCFG_CMP_PD(x)            (1 << 0)


/////////////////////////////////////////
// Reset and clock control
/////////////////////////////////////////
typedef struct
{
    arm_reg_t CR;       // Clock control
    arm_reg_t PLLCFGR;  // PLL configuration
    arm_reg_t CFGR;     // Clock configuration
    arm_reg_t CIR;      // Clock interrupt
    arm_reg_t AHB1RSTR; // AHB1 peripheral reset
    arm_reg_t AHB2RSTR; // AHB2 peripheral reset
    arm_reg_t AHB3RSTR; // AHB3 peripheral reset
    arm_reg_t reserve0;
    arm_reg_t APB1RSTR; // APB1 peripheral reset
    arm_reg_t APB2RSTR; // APB2 peripheral reset
    arm_reg_t reserve1[2];
    arm_reg_t AHB1ENR;  // AHB1 peripheral clock enable
    arm_reg_t AHB2ENR;  // AHB2 peripheral clock enable
    arm_reg_t AHB3ENR;  // AHB3 peripheral clock enable
    arm_reg_t reserve2;
    arm_reg_t APB1ENR;  // APB1 peripheral clock enable
    arm_reg_t APB2ENR;  // APB2 peripheral clock enable
    arm_reg_t reserve3[2];
    arm_reg_t AHB1LPENR;// AHB1 peripheral clock enable in low power mode
    arm_reg_t AHB2LPENR;// AHB2 peripheral clock enable in low power mode
    arm_reg_t AHB3LPENR;// AHB3 peripheral clock enable in low power mode
    arm_reg_t reserve4;
    arm_reg_t APB1LPENR;// APB1 peripheral clock enable in low power mode
    arm_reg_t APB2LPENR;// APB2 peripheral clock enable in low power mode
    arm_reg_t reserve5[2];
    arm_reg_t BDCR;     // Backup domain control
    arm_reg_t CSR;      // Clock control & status
    arm_reg_t reserve6[2];
    arm_reg_t SSCGR;    // Spread spectrum clock generation
    arm_reg_t PLLI2SCFGR; // PLL I2S configuration
    arm_reg_t PLLSAICFGR; // PLL SAI configuration
    arm_reg_t DCKCFGR;    // Dedicated clock configuration
} RCC_t;

#define RCC     ((RCC_t *) STM_RCC_BASE)

// CR bits
#define RCC_PLLI2SRDY           (1 << 27)
#define RCC_PLLI2SON            (1 << 26)   
#define RCC_PLLRDY              (1 << 25)
#define RCC_PLLON               (1 << 24)
#define RCC_CSSON               (1 << 19)
#define RCC_HSEBYP              (1 << 18)
#define RCC_HSERDY              (1 << 17)
#define RCC_HSEON               (1 << 16)
#define RCC_HSICAL(n)           ((n) << 8)
#define RCC_HSITRIM(n)          ((n) << 3)
#define RCC_HSIRDY              (1 << 1)
#define RCC_HSION               (1 << 0)

// PLLCFGR bits
#define RCC_PLLQ(n)             ((n) << 24)
#define RCC_PLLSRC_HSI          (0 << 22)
#define RCC_PLLSRC_HSE          (1 << 22)
#define RCC_PLLP_2              (0 << 16)
#define RCC_PLLP_4              (1 << 16)
#define RCC_PLLP_6              (2 << 16)
#define RCC_PLLP_8              (3 << 16)
#define RCC_PLLN(n)             ((n) << 6)
#define RCC_PLLM(n)             (n)

// CFGR bits
#define RCC_MCO2_SYSCLK         (0 << 30)
#define RCC_MCO2_PLLI2S         (1 << 30)
#define RCC_MCO2_HSE            (2 << 30)
#define RCC_MCO2_PLL            (3 << 30)
#define RCC_MCO2PRE_NODIV       (0 << 27)
#define RCC_MCO2PRE_DIV2        (4 << 27)
#define RCC_MCO2PRE_DIV3        (5 << 27)
#define RCC_MCO2PRE_DIV4        (6 << 27)
#define RCC_MCO2PRE_DIV5        (7 << 27)
#define RCC_MCO1PRE_NODIV       (0 << 24)
#define RCC_MCO1PRE_DIV2        (4 << 24)
#define RCC_MCO1PRE_DIV3        (5 << 24)
#define RCC_MCO1PRE_DIV4        (6 << 24)
#define RCC_MCO1PRE_DIV5        (7 << 24)
#define RCC_I2SSRC_EXT          (1 << 23)
#define RCC_MCO1_HSI            (0 << 21)
#define RCC_MCO1_LSE            (1 << 21)
#define RCC_MCO1_HSE            (2 << 21)
#define RCC_MCO1_PLL            (3 << 21)
#define RCC_RTCPRE              ((n) << 16)
#define RCC_PPRE2_NODIV         (0 << 13)
#define RCC_PPRE2_DIV2          (4 << 13)
#define RCC_PPRE2_DIV4          (5 << 13)
#define RCC_PPRE2_DIV8          (6 << 13)
#define RCC_PPRE2_DIV16         (7 << 13)
#define RCC_PPRE1_NODIV         (0 << 10)
#define RCC_PPRE1_DIV2          (4 << 10)
#define RCC_PPRE1_DIV4          (5 << 10)
#define RCC_PPRE1_DIV8          (6 << 10)
#define RCC_PPRE1_DIV16         (7 << 10)
#define RCC_HPRE_NODIV          (0 << 4)
#define RCC_HPRE_DIV2           (0x8 << 4)
#define RCC_HPRE_DIV4           (0x9 << 4)
#define RCC_HPRE_DIV8           (0xA << 4)
#define RCC_HPRE_DIV16          (0xB << 4)
#define RCC_HPRE_DIV64          (0xC << 4)
#define RCC_HPRE_DIV128         (0xD << 4)
#define RCC_HPRE_DIV256         (0xE << 4)
#define RCC_HPRE_DIV512         (0xF << 4)
#define RCC_SWS_HSI             (0 << 2)
#define RCC_SWS_HSE             (1 << 2)
#define RCC_SWS_PLL             (2 << 2)
#define RCC_SWS_MASK            (3 << 2)
#define RCC_SW_HSI              (0 << 0)
#define RCC_SW_HSE              (1 << 0)
#define RCC_SW_PLL              (2 << 0)
#define RCC_SW_MASK             (3 << 0)

