alexrayne/uos-embedded/sources/runtime/cortex-m/io-stm32f2.h
// CIR bits
#define RCC_CSSC                (1 << 23)
#define RCC_PLLI2SRDYC          (1 << 21)
#define RCC_PLLRDYC             (1 << 20)
#define RCC_HSERDYC             (1 << 19)
#define RCC_HSIRDYC             (1 << 18)
#define RCC_LSERDYC             (1 << 17)
#define RCC_LSIRDYC             (1 << 16)
#define RCC_PLLI2SRDYIE         (1 << 13)
#define RCC_PLLRDYIE            (1 << 12)
#define RCC_HSERDYIE            (1 << 11)
#define RCC_HSIRDYIE            (1 << 10)
#define RCC_LSERDYIE            (1 << 9)
#define RCC_LSIRDYIE            (1 << 8)
#define RCC_CSSF                (1 << 7)
#define RCC_PLLI2SRDYF          (1 << 5)
#define RCC_PLLRDYF             (1 << 4)
#define RCC_HSERDYF             (1 << 3)
#define RCC_HSIRDYF             (1 << 2)
#define RCC_LSERDYF             (1 << 1)
#define RCC_LSIRDYF             (1 << 0)

// AHB1RSTR bits
#define RCC_OTGHSRST            (1 << 29)
#define RCC_ETHMACRST           (1 << 25)
#define RCC_DMA2RST             (1 << 22)
#define RCC_DMA1RST             (1 << 21)
#define RCC_CRCRST              (1 << 12)
#define RCC_GPIOIRST            (1 << 8)
#define RCC_GPIOHRST            (1 << 7)
#define RCC_GPIOGRST            (1 << 6)
#define RCC_GPIOFRST            (1 << 5)
#define RCC_GPIOERST            (1 << 4)
#define RCC_GPIODRST            (1 << 3)
#define RCC_GPIOCRST            (1 << 2)
#define RCC_GPIOBRST            (1 << 1)
#define RCC_GPIOARST            (1 << 0)

// AHB2RSTR bits
#define RCC_OTGFSRST            (1 << 7)
#define RCC_RNGRST              (1 << 6)
#define RCC_HASHRST             (1 << 5)
#define RCC_CRYPRST             (1 << 4)
#define RCC_DCMIRST             (1 << 0)

// AHB3RSTR bits
#define RCC_FSMCRST             (1 << 0)

// APB1RSTR bits
#define RCC_DACRST              (1 << 29)
#define RCC_PWRRST              (1 << 28)
#define RCC_CAN2RST             (1 << 26)
#define RCC_CAN1RST             (1 << 25)
#define RCC_I2C3RST             (1 << 23)
#define RCC_I2C2RST             (1 << 22)
#define RCC_I2C1RST             (1 << 21)
#define RCC_UART5RST            (1 << 20)
#define RCC_UART4RST            (1 << 19)
#define RCC_USART3RST           (1 << 18)
#define RCC_USART2RST           (1 << 17)
#define RCC_SPI3RST             (1 << 15)
#define RCC_SPI2RST             (1 << 14)
#define RCC_WWDGRST             (1 << 11)
#define RCC_TIM14RST            (1 << 8)
#define RCC_TIM13RST            (1 << 7)
#define RCC_TIM12RST            (1 << 6)
#define RCC_TIM7RST             (1 << 5)
#define RCC_TIM6RST             (1 << 4)
#define RCC_TIM5RST             (1 << 3)
#define RCC_TIM4RST             (1 << 2)
#define RCC_TIM3RST             (1 << 1)
#define RCC_TIM2RST             (1 << 0)

// APB2RSTR bits
#define RCC_TIM11RST            (1 << 18)
#define RCC_TIM10RST            (1 << 17)
#define RCC_TIM9RST             (1 << 16)
#define RCC_SYSCFGRST           (1 << 14)
#define RCC_SPI1RST             (1 << 12)
#define RCC_SDIORST             (1 << 11)
#define RCC_ADCRST              (1 << 8)
#define RCC_USART6RST           (1 << 5)
#define RCC_USART1RST           (1 << 4)
#define RCC_TIM8RST             (1 << 1)
#define RCC_TIM1RST             (1 << 0)

// AHB1ENR bits
#define RCC_OTGHSULPIEN         (1 << 30)
#define RCC_OTGHSEN             (1 << 29)
#define RCC_ETHMACPTPEN         (1 << 28)
#define RCC_ETHMACRXEN          (1 << 27)
#define RCC_ETHMACTXEN          (1 << 26)
#define RCC_ETHMACEN            (1 << 25)
#define RCC_DMA2EN              (1 << 22)
#define RCC_DMA1EN              (1 << 21)
#define RCC_BKPSRAMEN           (1 << 18)
#define RCC_CRCEN               (1 << 12)
#define RCC_GPIOIEN             (1 << 8)
#define RCC_GPIOHEN             (1 << 7)
#define RCC_GPIOGEN             (1 << 6)
#define RCC_GPIOFEN             (1 << 5)
#define RCC_GPIOEEN             (1 << 4)
#define RCC_GPIODEN             (1 << 3)
#define RCC_GPIOCEN             (1 << 2)
#define RCC_GPIOBEN             (1 << 1)
#define RCC_GPIOAEN             (1 << 0)

// AHB2ENR bits
#define RCC_OTGFSEN             (1 << 7)
#define RCC_RNGEN               (1 << 6)
#define RCC_HASHEN              (1 << 5)
#define RCC_CRYPEN              (1 << 4)
#define RCC_DCMIEN              (1 << 0)

// AHB3ENR bits
#define RCC_FSMCEN              (1 << 0)

// APB1ENR bits
#define RCC_DACEN               (1 << 29)
#define RCC_PWREN               (1 << 28)
#define RCC_CAN2EN              (1 << 26)
#define RCC_CAN1EN              (1 << 25)
#define RCC_I2C3EN              (1 << 23)
#define RCC_I2C2EN              (1 << 22)
#define RCC_I2C1EN              (1 << 21)
#define RCC_UART5EN             (1 << 20)
#define RCC_UART4EN             (1 << 19)
#define RCC_USART3EN            (1 << 18)
#define RCC_USART2EN            (1 << 17)
#define RCC_SPI3EN              (1 << 15)
#define RCC_SPI2EN              (1 << 14)
#define RCC_WWDGEN              (1 << 11)
#define RCC_TIM14EN             (1 << 8)
#define RCC_TIM13EN             (1 << 7)
#define RCC_TIM12EN             (1 << 6)
#define RCC_TIM7EN              (1 << 5)
#define RCC_TIM6EN              (1 << 4)
#define RCC_TIM5EN              (1 << 3)
#define RCC_TIM4EN              (1 << 2)
#define RCC_TIM3EN              (1 << 1)
#define RCC_TIM2EN              (1 << 0)

// APB2ENR bits
#define RCC_TIM11EN             (1 << 18)
#define RCC_TIM10EN             (1 << 17)
#define RCC_TIM9EN              (1 << 16)
#define RCC_SYSCFGEN            (1 << 14)
#define RCC_SPI1EN              (1 << 12)
#define RCC_SDIOEN              (1 << 11)
#define RCC_ADC3EN              (1 << 10)
#define RCC_ADC2EN              (1 << 9)
#define RCC_ADC1EN              (1 << 8)
#define RCC_USART6EN            (1 << 5)
#define RCC_USART1EN            (1 << 4)
#define RCC_TIM8EN              (1 << 1)
#define RCC_TIM1EN              (1 << 0)

// AHB1LPENR bits
#define RCC_OTGHSULPILPEN       (1 << 30)
#define RCC_OTGHSLPEN           (1 << 29)
#define RCC_ETHMACPTPLPEN       (1 << 28)
#define RCC_ETHMACRXLPEN        (1 << 27)
#define RCC_ETHMACTXLPEN        (1 << 26)
#define RCC_ETHMACLPEN          (1 << 25)
#define RCC_DMA2LPEN            (1 << 22)
#define RCC_DMA1LPEN            (1 << 21)
#define RCC_SRAM3LPEN           (1 << 19)
#define RCC_BKPSRAMLPEN         (1 << 18)
#define RCC_SRAM2LPEN           (1 << 17)
#define RCC_SRAM1LPEN           (1 << 16)
#define RCC_FLITFLPEN           (1 << 15)
#define RCC_CRCLPEN             (1 << 12)
#define RCC_GPIOILPEN           (1 << 8)
#define RCC_GPIOHLPEN           (1 << 7)
#define RCC_GPIOGLPEN           (1 << 6)
#define RCC_GPIOFLPEN           (1 << 5)
#define RCC_GPIOELPEN           (1 << 4)
#define RCC_GPIODLPEN           (1 << 3)
#define RCC_GPIOCLPEN           (1 << 2)
#define RCC_GPIOBLPEN           (1 << 1)
#define RCC_GPIOALPEN           (1 << 0)

// AHB2LPENR bits
#define RCC_OTGFSLPEN           (1 << 7)
#define RCC_RNGLPEN             (1 << 6)
#define RCC_HASHLPEN            (1 << 5)
#define RCC_CRYPLPEN            (1 << 4)
#define RCC_DCMILPEN            (1 << 0)

// AHB3LPENR bits
#define RCC_FSMCLPEN            (1 << 0)

