alexrayne/uos-embedded/sources/runtime/cortex-m/io-stm32f2.h
// APB1LPENR bits
#define RCC_DACLPEN             (1 << 29)
#define RCC_PWRLPEN             (1 << 28)
#define RCC_CAN2LPEN            (1 << 26)
#define RCC_CAN1LPEN            (1 << 25)
#define RCC_I2C3LPEN            (1 << 23)
#define RCC_I2C2LPEN            (1 << 22)
#define RCC_I2C1LPEN            (1 << 21)
#define RCC_UART5LPEN           (1 << 20)
#define RCC_UART4LPEN           (1 << 19)
#define RCC_USART3LPEN          (1 << 18)
#define RCC_USART2LPEN          (1 << 17)
#define RCC_SPI3LPEN            (1 << 15)
#define RCC_SPI2LPEN            (1 << 14)
#define RCC_WWDGLPEN            (1 << 11)
#define RCC_TIM14LPEN           (1 << 8)
#define RCC_TIM13LPEN           (1 << 7)
#define RCC_TIM12LPEN           (1 << 6)
#define RCC_TIM7LPEN            (1 << 5)
#define RCC_TIM6LPEN            (1 << 4)
#define RCC_TIM5LPEN            (1 << 3)
#define RCC_TIM4LPEN            (1 << 2)
#define RCC_TIM3LPEN            (1 << 1)
#define RCC_TIM2LPEN            (1 << 0)

// APB2LPENR bits
#define RCC_TIM11LPEN           (1 << 18)
#define RCC_TIM10LPEN           (1 << 17)
#define RCC_TIM9LPEN            (1 << 16)
#define RCC_SYSCFGLPEN          (1 << 14)
#define RCC_SPI1LPEN            (1 << 12)
#define RCC_SDIOLPEN            (1 << 11)
#define RCC_ADC3LPEN            (1 << 10)
#define RCC_ADC2LPEN            (1 << 9)
#define RCC_ADC1LPEN            (1 << 8)
#define RCC_USART6LPEN          (1 << 5)
#define RCC_USART1LPEN          (1 << 4)
#define RCC_TIM8LPEN            (1 << 1)
#define RCC_TIM1LPEN            (1 << 0)

// BDCR bits
#define RCC_BDRST               (1 << 16)
#define RCC_RTCEN               (1 << 15)
#define RCC_RTCSEL_NOCLK        (0 << 8)
#define RCC_RTCSEL_LSE          (1 << 8)
#define RCC_RTCSEL_LSI          (2 << 8)
#define RCC_RTCSEL_HSE          (3 << 8)
#define RCC_LSEBYP              (1 << 2)
#define RCC_LSERDY              (1 << 1)
#define RCC_LSEON               (1 << 0)

// CSR bits
#define RCC_LPWRRSTF            (1 << 31)
#define RCC_WWDGRSTF            (1 << 30)
#define RCC_IWDGRSTF            (1 << 29)
#define RCC_SFTRSTF             (1 << 28)
#define RCC_PORRSTF             (1 << 27)
#define RCC_PINRSTF             (1 << 26)
#define RCC_BORRSTF             (1 << 25)
#define RCC_RMVF                (1 << 24)
#define RCC_LSIRDY              (1 << 1)
#define RCC_LSION               (1 << 0)

// SSCGR bits
#define RCC_SSCGEN              (1 << 31)
#define RCC_SPREADSEL           (1 << 30)
#define RCC_INCSTEP(n)          ((n) << 13)
#define RCC_MODPER(n)           (n)

// PLLI2SCFGR bits
#define RCC_PLLI2SR(n)          ((n) << 28)
#define RCC_PLLI2SN(n)          ((n) << 6)


/////////////////////////////////////////
// Flash interface
/////////////////////////////////////////
typedef struct
{
    arm_reg_t ACR;
    arm_reg_t KEYR;
    arm_reg_t OPTKEYR;
    arm_reg_t SR;
    arm_reg_t CR;
    arm_reg_t OPTCR;
    arm_reg_t OPTCR1;
} FLASH_t;

#define FLASH                   ((FLASH_t*) STM_FLASH_IFACE_BASE)

// ACR bits
#define FLASH_DCRST              (1 << 12)
#define FLASH_ICRST             (1 << 11)
#define FLASH_DCEN              (1 << 10)
#define FLASH_ICEN              (1 << 9)
#define FLASH_PRFTEN            (1 << 8)
#define FLASH_LATENCY(n)        (n)

// OPTKEYR bits
#define FLASH_OPTKEY1           0x08192A3B
#define FLASH_OPTKEY2           0x4C5D6E7F

// SR bits
#define FLASH_BSY               (1 << 16)
#define FLASH_RDERR             (1 << 7)
#define FLASH_PGSERR            (1 << 7)
#define FLASH_PGPERR            (1 << 6)
#define FLASH_PGAERR            (1 << 5)
#define FLASH_WRPERR            (1 << 4)
#define FLASH_OPERR             (1 << 1)
#define FLASH_EOP               (1 << 0)

// CR bits
#define FLASH_LOCK              (1 << 31)
#define FLASH_ERRIE             (1 << 25)
#define FLASH_EOPIE             (1 << 24)
#define FLASH_STRT              (1 << 16)
#define FLASH_PSIZE_8           (0 << 8)
#define FLASH_PSIZE_16          (1 << 8)
#define FLASH_PSIZE_32          (2 << 8)
#define FLASH_PSIZE_64          (3 << 8)
#define FLASH_SNB(n)            ((n) << 3)
#define FLASH_MER               (1 << 2)
#define FLASH_SER               (1 << 1)
#define FLASH_PG                (1 << 0)

// OPTCR bits
#define FLASH_NWRP(n)           (1 << (n) << 16)    // also for OPTCR1
#define FLASH_ALL_WRITABLE      (0xFFF << 16)       // also for OPTCR1
#define FLASH_RDP_LEVEL0        (0xAA << 8)
#define FLASH_RDP_LEVEL1        (0x00 << 8)
#define FLASH_RDP_LEVEL2        (0xCC << 8)
#define FLASH_NRST_STDBY        (1 << 7)
#define FLASH_NRST_STOP         (1 << 6)
#define FLASH_WDG_SW            (1 << 5)
#define FLASH_BFB2              (1 << 4)
#define FLASH_BOR_LEV(n)        ((n) << 2)
#define FLASH_OPTSTRT           (1 << 1)
#define FLASH_OPTLOCK           (1 << 0)


/////////////////////////////////////////
// Option bytes
/////////////////////////////////////////

#define OB_RDP_USER     *((volatile uint16_t *) 0x1FFFC000)
#define OB_WRP_LOW      *((volatile uint16_t *) 0x1FFFC008)
#define OB_WRP_HIGH     *((volatile uint16_t *) 0x1FFEC008)

// RDP and USER bits
#define OB_RDP_LEVEL0           (0xAA << 8)
#define OB_RDP_LEVEL1           (0x00 << 8)
#define OB_RDP_LEVEL2           (0xCC << 8)
#define OB_NRST_STDBY           (1 << 7)
#define OB_NRST_STOP            (1 << 6)
#define OB_WDG_SW               (1 << 5)
#define OB_BFB2                 (1 << 4)
#define OB_BOR_LEV(n)           ((n) << 2)

// WRP_LOW bits
#define OB_SPRMOD               (1 << 15)
#define OB_DB1M                 (1 << 14)
#define OB_NWRP(n)              (1 << (n))


/////////////////////////////////////////
// General purpose I/O
/////////////////////////////////////////
typedef struct
{
    arm_reg_t MODER;    // Mode
    arm_reg_t OTYPER;   // Output type
    arm_reg_t OSPEEDR;  // Output speed
    arm_reg_t PUPDR;    // Pull-up/pull-down
    arm_reg_t IDR;      // Input data
    arm_reg_t ODR;      // Output data
    arm_reg_t BSRR;     // Bit set/reset
    arm_reg_t LCKR;     // Configuration lock
    arm_reg_t AFRL;     // Alternate function low register
    arm_reg_t AFRH;     // Alternate function high register
} GPIO_t;

