alexrayne/uos-embedded/sources/runtime/cortex-m/io-stm32f2.h
// ADC_CR1
#define ADC_OVRIE               (1 << 26)
#define ADC_RES_12BIT           (0 << 24)
#define ADC_RES_10BIT           (1 << 24)
#define ADC_RES_8BIT            (2 << 24)
#define ADC_RES_6BIT            (3 << 24)
#define ADC_AWDEN               (1 << 23)
#define ADC_JAWDEN              (1 << 22)
#define ADC_DISCNUM(n)          ((n) << 13)
#define ADC_JDISCEN             (1 << 12)
#define ADC_DISCEN              (1 << 11)
#define ADC_JAUTO               (1 << 10)
#define ADC_AWDSGL              (1 << 9)
#define ADC_SCAN                (1 << 8)
#define ADC_JOECIE              (1 << 7)
#define ADC_AWDIE               (1 << 6)
#define ADC_EOCIE               (1 << 5)
#define ADC_AWDCH(n)            ((n) & 0x1F)

// ADC_CR2
#define ADC_SWSTART             (1 << 30)
#define ADC_EXTEN_DISABLE       (0 << 28)
#define ADC_EXTEN_RISING        (1 << 28)
#define ADC_EXTEN_FALLING       (2 << 28)
#define ADC_EXTEN_BOTH          (3 << 28)
#define ADC_EXTSEL_TIM1_CC1     (0 << 24)
#define ADC_EXTSEL_TIM1_CC2     (1 << 24)
#define ADC_EXTSEL_TIM1_CC3     (2 << 24)
#define ADC_EXTSEL_TIM2_CC2     (3 << 24)
#define ADC_EXTSEL_TIM2_CC3     (4 << 24)
#define ADC_EXTSEL_TIM2_CC4     (5 << 24)
#define ADC_EXTSEL_TIM2_TRGO    (6 << 24)
#define ADC_EXTSEL_TIM3_CC1     (7 << 24)
#define ADC_EXTSEL_TIM3_TRGO    (8 << 24)
#define ADC_EXTSEL_TIM4_CC4     (9 << 24)
#define ADC_EXTSEL_TIM5_CC1     (10 << 24)
#define ADC_EXTSEL_TIM5_CC2     (11 << 24)
#define ADC_EXTSEL_TIM5_CC3     (12 << 24)
#define ADC_EXTSEL_TIM8_CC1     (13 << 24)
#define ADC_EXTSEL_TIM8_TRGO    (14 << 24)
#define ADC_EXTSEL_EXTI11       (15 << 24)
#define ADC_JSWSTART            (1 << 22)
#define ADC_JEXTEN_DISABLE      (0 << 20)
#define ADC_JEXTEN_RISING       (1 << 20)
#define ADC_JEXTEN_FALLING      (2 << 20)
#define ADC_JEXTEN_BOTH         (3 << 20)
#define ADC_JEXTSEL_TIM1_CC4    (0 << 16)
#define ADC_JEXTSEL_TIM1_TRGO   (1 << 16)
#define ADC_JEXTSEL_TIM2_CC1    (2 << 16)
#define ADC_JEXTSEL_TIM2_TRGO   (3 << 16)
#define ADC_JEXTSEL_TIM3_CC2    (4 << 16)
#define ADC_JEXTSEL_TIM3_CC4    (5 << 16)
#define ADC_JEXTSEL_TIM4_CC1    (6 << 16)
#define ADC_JEXTSEL_TIM4_CC2    (7 << 16)
#define ADC_JEXTSEL_TIM4_CC3    (8 << 16)
#define ADC_JEXTSEL_TIM4_TRGO   (9 << 16)
#define ADC_JEXTSEL_TIM5_CC4    (10 << 16)
#define ADC_JEXTSEL_TIM5_TRGO   (11 << 16)
#define ADC_JEXTSEL_TIM8_CC1    (12 << 16)
#define ADC_JEXTSEL_TIM8_CC2    (13 << 16)
#define ADC_JEXTSEL_TIM8_CC3    (14 << 16)
#define ADC_JEXTSEL_EXTI15      (15 << 16)
#define ADC_ALIGN               (1 << 11)
#define ADC_EOCS                (1 << 10)
#define ADC_DDS                 (1 << 9)
#define ADC_DMA                 (1 << 8)
#define ADC_CONT                (1 << 1)
#define ADC_ADON                (1 << 0)

// ADC_SMPR1, ADC_SMPR2
#define ADC_SMP_3CYCLES(n)      (0 << (3 * (n%10)))
#define ADC_SMP_15CYCLES(n)     (1 << (3 * (n%10)))
#define ADC_SMP_28CYCLES(n)     (2 << (3 * (n%10)))
#define ADC_SMP_56CYCLES(n)     (3 << (3 * (n%10)))
#define ADC_SMP_84CYCLES(n)     (4 << (3 * (n%10)))
#define ADC_SMP_112CYCLES(n)    (5 << (3 * (n%10)))
#define ADC_SMP_144CYCLES(n)    (6 << (3 * (n%10)))
#define ADC_SMP_480CYCLES(n)    (7 << (3 * (n%10)))

// ADC_SQR1
#define ADC_L(n)                (((n) - 1) << 20)
#define ADC_SQ16(n)             ((n) << 15)
#define ADC_SQ15(n)             ((n) << 10)
#define ADC_SQ14(n)             ((n) << 5)
#define ADC_SQ13(n)             ((n) << 0)

// ADC_SQR2
#define ADC_SQ12(n)             ((n) << 26)
#define ADC_SQ11(n)             ((n) << 20)
#define ADC_SQ10(n)             ((n) << 15)
#define ADC_SQ9(n)              ((n) << 10)
#define ADC_SQ8(n)              ((n) << 5)
#define ADC_SQ7(n)              ((n) << 0)

// ADC_SQR3
#define ADC_SQ6(n)              ((n) << 25)
#define ADC_SQ5(n)              ((n) << 20)
#define ADC_SQ4(n)              ((n) << 15)
#define ADC_SQ3(n)              ((n) << 10)
#define ADC_SQ2(n)              ((n) << 5)
#define ADC_SQ1(n)              ((n) << 0)

// ADC_JSQR
#define ADC_JL(n)               ((n) << 20)
#define ADC_JSQ4(n)             ((n) << 15)
#define ADC_JSQ3(n)             ((n) << 10)
#define ADC_JSQ2(n)             ((n) << 5)
#define ADC_JSQ1(n)             ((n) << 0)

// ADC_CSR
#define ADC_OVR1                (1 << 5)
#define ADC_STRT1               (1 << 4)
#define ADC_JSTRT1              (1 << 3)
#define ADC_JEOC1               (1 << 2)
#define ADC_EOC1                (1 << 1)
#define ADC_AWD1                (1 << 0)

// ADC_CCR
#define ADC_TSVREFE             (1 << 23)
#define ADC_VBATE               (1 << 22)
#define ADC_ADCPRE_DIV2         (0 << 16)
#define ADC_ADCPRE_DIV4         (1 << 16)
#define ADC_ADCPRE_DIV6         (2 << 16)
#define ADC_ADCPRE_DIV8         (3 << 16)
#define ADC_DMA_DISABLE         (0 << 14)
#define ADC_DMA_MODE1           (1 << 14)
#define ADC_DMA_MODE2           (2 << 14)
#define ADC_DMA_MODE3           (3 << 14)
#define ADC_COMMON_DDS          (1 << 13)
#define ADC_DELAY(n)            (((n) - 5) << 8)
#define ADC_MULTI_INDEP                         (0 << 0)
#define ADC_MULTI_DUAL_REG_SIM_INJ_SIM          (1 << 0)
#define ADC_MULTI_DUAL_REG_SIM_INJ_ALT          (2 << 0)
#define ADC_MULTI_DUAL_INJ_SIM                  (5 << 0)
#define ADC_MULTI_DUAL_REG_SIM                  (6 << 0)
#define ADC_MULTI_DUAL_INTERLEAVED              (7 << 0)
#define ADC_MULTI_DUAL_ALT                      (9 << 0)
#define ADC_MULTI_TRIPLE_REG_SIM_INJ_SIM        (17 << 0)
#define ADC_MULTI_TRIPLE_REG_SIM_INJ_ALT        (18 << 0)
#define ADC_MULTI_TRIPLE_INJ_SIM                (21 << 0)
#define ADC_MULTI_TRIPLE_REG_SIM                (22 << 0)
#define ADC_MULTI_TRIPLE_INTERLEAVED            (23 << 0)
#define ADC_MULTI_TRIPLE_ALT                    (25 << 0)

// ADC CDR
#define ADC_GET_DATA2(r)        ((r) >> 16)
#define ADC_GET_DATA1(r)        ((r) & 0xFF)


/////////////////////////////////////////
// DMA
/////////////////////////////////////////
typedef struct
{
    arm_reg_t CR;       // Configuration
    arm_reg_t NDTR;     // Number of data
    arm_reg_t PAR;      // Peripheral address
    arm_reg_t M0AR;     // Memory 0 address
    arm_reg_t M1AR;     // Memory 1 address
    arm_reg_t FCR;      // FIFO control
} DMA_STREAM_t;

typedef struct
{
    arm_reg_t       LISR;       // Low Interrupt Status
    arm_reg_t       HISR;       // High Interrupt Status
    arm_reg_t       LIFCR;      // Low Interrupt Flag Clear
    arm_reg_t       HIFCR;      // High Interrupt Flag Clear
    DMA_STREAM_t    stream[8];  // DMA stream registers
} DMA_t;

#define DMA1    ((DMA_t*) STM_DMA1_BASE)
#define DMA2    ((DMA_t*) STM_DMA2_BASE)

#define DMA1_STR(x)     ((DMA_STREAM_t *) &(DMA1->stream[(x)]))
#define DMA2_STR(x)     ((DMA_STREAM_t *) &(DMA2->stream[(x)]))

// LISR, HISR bits
#define DMA_TCIF(x)         (32 << ((((x) % 2) * 6) + (((x) % 4) >= 2) ? 16 : 0))
#define DMA_HTIF(x)         (16 << ((((x) % 2) * 6) + (((x) % 4) >= 2) ? 16 : 0))
#define DMA_TEIF(x)         ( 8 << ((((x) % 2) * 6) + (((x) % 4) >= 2) ? 16 : 0))
#define DMA_DMEIF(x)        ( 4 << ((((x) % 2) * 6) + (((x) % 4) >= 2) ? 16 : 0))
#define DMA_FEIF(x)         ( 1 << ((((x) % 2) * 6) + (((x) % 4) >= 2) ? 16 : 0))

// LIFSR, HIFSR bits
#define DMA_CTCIF(x)        (32 << ((((x) % 2) * 6) + (((x) % 4) >= 2) ? 16 : 0))
#define DMA_CHTIF(x)        (16 << ((((x) % 2) * 6) + (((x) % 4) >= 2) ? 16 : 0))
#define DMA_CTEIF(x)        ( 8 << ((((x) % 2) * 6) + (((x) % 4) >= 2) ? 16 : 0))
#define DMA_CDMEIF(x)       ( 4 << ((((x) % 2) * 6) + (((x) % 4) >= 2) ? 16 : 0))
#define DMA_CFEIF(x)        ( 1 << ((((x) % 2) * 6) + (((x) % 4) >= 2) ? 16 : 0))

// Stream CR bits
#define DMA_CHSEL(x)        ((x) << 25)
#define DMA_MBURST_SINGLE   (0 << 23)
#define DMA_MBURST_INCR4    (1 << 23)
#define DMA_MBURST_INCR8    (2 << 23)
#define DMA_MBURST_INCR16   (3 << 23)
#define DMA_PBURST_SINGLE   (0 << 21)
#define DMA_PBURST_INCR4    (1 << 21)
#define DMA_PBURST_INCR8    (2 << 21)
#define DMA_PBURST_INCR16   (3 << 21)
#define DMA_CT              (1 << 19)
#define DMA_DBM             (1 << 18)
#define DMA_PL(x)           ((x) << 16)
#define DMA_PINCOS          (1 << 15)
#define DMA_MSIZE_8         (0 << 13)
#define DMA_MSIZE_16        (1 << 13)
#define DMA_MSIZE_32        (2 << 13)
#define DMA_PSIZE_8         (0 << 11)
#define DMA_PSIZE_16        (1 << 11)
#define DMA_PSIZE_32        (2 << 11)
#define DMA_MINC            (1 << 10)
#define DMA_PINC            (1 << 9)
#define DMA_CIRC            (1 << 8)
#define DMA_DIR_P2M         (0 << 6)
#define DMA_DIR_M2P         (1 << 6)
#define DMA_DIR_M2M         (2 << 6)
#define DMA_PFCTRL          (1 << 5)
#define DMA_TCIE            (1 << 4)
#define DMA_HTIE            (1 << 3)
#define DMA_TEIE            (1 << 2)
#define DMA_DMEIE           (1 << 1)
#define DMA_EN              (1 << 0)

// FCR bits
#define DMA_FEIE            (1 << 7)
#define DMA_FS_MASK         0x38
#define DMA_FS_0_TO_14      (0 << 3)
#define DMA_FS_14_TO_12     (1 << 3)
#define DMA_FS_12_TO_34     (2 << 3)
#define DMA_FS_34_TO_FULL   (3 << 3)
#define DMA_FS_EMPTY        (4 << 3)
#define DMA_FS_FULL         (5 << 3)
#define DMA_DMDIS           (1 << 2)
#define DMA_FTH_14          (0 << 0)
#define DMA_FTH_12          (1 << 0)
#define DMA_FTH_34          (2 << 0)
#define DMA_FTH_FULL        (3 << 0)


/////////////////////////////////////////
// I2C
/////////////////////////////////////////
typedef struct
{
    arm_reg_t CR1;      // Control 1
    arm_reg_t CR2;      // Control 2
    arm_reg_t OAR1;     // Own address 1
    arm_reg_t OAR2;     // Own address 2
    arm_reg_t DR;       // Data
    arm_reg_t SR1;      // Status 1
    arm_reg_t SR2;      // Status 2
    arm_reg_t CCR;      // Clock control
    arm_reg_t TRISE;    // TRISE
    arm_reg_t FLTR;     // Filter
} I2C_t;

#define I2C1    ((I2C_t*) STM_I2C1_BASE)
#define I2C2    ((I2C_t*) STM_I2C2_BASE)
#define I2C3    ((I2C_t*) STM_I2C3_BASE)

