alexrayne/uos-embedded/sources/runtime/cortex-m/io-stm32f2.h
// I2C_CR1 bits
#define I2C_SWRST           (1 << 15)
#define I2C_ALERT           (1 << 13)
#define I2C_PEC             (1 << 12)
#define I2C_POS             (1 << 11)
#define I2C_ACK             (1 << 10)
#define I2C_STOP            (1 << 9)
#define I2C_START           (1 << 8)
#define I2C_NOSTRETCH       (1 << 7)
#define I2C_ENGC            (1 << 6)
#define I2C_ENPEC           (1 << 5)
#define I2C_ENARR           (1 << 4)
#define I2C_SMBTYPE         (1 << 3)
#define I2C_SMBUS           (1 << 1)
#define I2C_PE              (1 << 0)

// I2C_CR2 bits
#define I2C_LAST            (1 << 12)
#define I2C_DMAEN           (1 << 11)
#define I2C_ITBUFEN         (1 << 10)
#define I2C_ITEVTEN         (1 << 9)
#define I2C_ITERREN         (1 << 8)
#define I2C_FREQ(x)         ((x) << 0)

// I2C_OAR1 bits
#define I2C_ADDMODE         (1 << 15)
#define I2C_ALWAYS_ONE      (1 << 14)
#define I2C_ADD(x)          ((x) << 0)

// I2C_OAR2 bits
#define I2C_ADD2(x)         ((x) << 1)
#define I2C_ENDUAL          (1 << 0)

// I2C_SR1 bits
#define I2C_SMBALERT        (1 << 15)
#define I2C_TIMEOUT         (1 << 14)
#define I2C_PECERR          (1 << 12)
#define I2C_OVR             (1 << 11)
#define I2C_AF              (1 << 10)
#define I2C_ARLO            (1 << 9)
#define I2C_BERR            (1 << 8)
#define I2C_TXE             (1 << 7)
#define I2C_RXNE            (1 << 6)
#define I2C_STOPF           (1 << 4)
#define I2C_ADD10           (1 << 3)
#define I2C_BTF             (1 << 2)
#define I2C_ADDR            (1 << 1)
#define I2C_SB              (1 << 0)

// I2C_SR2 bits
#define I2C_PECR(x)         ((x) << 8)
#define I2C_DUALF           (1 << 7)
#define I2C_SMBHOST         (1 << 6)
#define I2C_SMBDEFAULT      (1 << 5)
#define I2C_GENCALL         (1 << 4)
#define I2C_TRA             (1 << 2)
#define I2C_BUSY            (1 << 1)
#define I2C_MSL             (1 << 0)

// I2C_CCR bits
#define I2C_FS              (1 << 15)
#define I2C_DUTY            (1 << 14)
#define I2C_CCR(x)          ((x) << 0)

// I2C_FLTR bits
#define I2C_ANOFF           (1 << 4)
#define I2C_DNF(x)          ((x) << 0)


/////////////////////////////////////////
// RTC
/////////////////////////////////////////
typedef struct
{
    arm_reg_t TR;       // Time
    arm_reg_t DR;       // Date
    arm_reg_t CR;       // Control
    arm_reg_t ISR;      // Initialization and status
    arm_reg_t PRER;     // Prescaler
    arm_reg_t WUTR;     // Wakeup timer
    arm_reg_t CALIBR;   // Calibration
    arm_reg_t ALRMAR;   // Alarm A
    arm_reg_t ALRMBR;   // Alarm B
    arm_reg_t WPR;      // Write protection
    arm_reg_t SSR;      // Sub second
    arm_reg_t SHIFTR;   // Shift control
    arm_reg_t TSTR;     // Time stamp time
    arm_reg_t TSDR;     // Time stamp date
    arm_reg_t TSSSR;    // Timestamp sub second
    arm_reg_t CALR;     // Calibration
    arm_reg_t TAFCR;    // Tamper and alternate function configuration
    arm_reg_t ALRMASSR; // Alarm A sub second
    arm_reg_t ALRMBSSR; // Alarm B sub second
    arm_reg_t gap0;
    arm_reg_t BKPR[20]; // Backup registers
} RTC_t;

#define RTC   ((RTC_t*) STM_RTC_BKP_BASE)

// TR, TSTR bits
#define RTC_PM          (1 << 22)
#define RTC_HT(x)       ((x) << 20)
#define RTC_GET_HT(r)   (((r) >> 20) & 0x3)
#define RTC_HU(x)       ((x) << 16)
#define RTC_GET_HU(r)   (((r) >> 16) & 0xF)
#define RTC_MNT(x)      ((x) << 12)
#define RTC_GET_MNT(r)  (((r) >> 12) & 0x7)
#define RTC_MNU(x)      ((x) << 8)
#define RTC_GET_MNU(r)  (((r) >> 8) & 0xF)
#define RTC_ST(x)       ((x) << 4)
#define RTC_GET_ST(r)   (((r) >> 4) & 0x7)
#define RTC_SU(x)       ((x))
#define RTC_GET_SU(r)   (((r)) & 0xF)

// DR, TSDR (low 16 bits) bits
#define RTC_YT(x)       ((x) << 20)
#define RTC_GET_YT(r)   (((r) >> 20) & 0xF)
#define RTC_YU(x)       ((x) << 16)
#define RTC_GET_YU(r)   (((r) >> 16) & 0xF)
#define RTC_WDU(x)      ((x) << 13)
#define RTC_GET_WDU(r)  (((r) >> 13) & 0x7)
#define RTC_WDU_MON     1
#define RTC_WDU_TUE     2
#define RTC_WDU_WED     3
#define RTC_WDU_THU     4
#define RTC_WDU_FRI     5
#define RTC_WDU_SAT     6
#define RTC_WDU_SUN     7
#define RTC_MT(x)       ((x) << 12)
#define RTC_GET_MT(r)   (((r) >> 12) & 0x1)
#define RTC_MU(x)       ((x) << 8)
#define RTC_GET_MU(r)   (((r) >> 8) & 0xF)
#define RTC_DT(x)       ((x) << 4)
#define RTC_GET_DT(r)   (((r) >> 4) & 0x3)
#define RTC_DU(x)       ((x))
#define RTC_GET_DU(r)   (((r)) & 0xF)

// CR bits
#define RTC_COE         (1 << 23)
#define RTC_OSEL(x)     ((x) << 21)
#define RTC_POL         (1 << 20)
#define RTC_COSEL       (1 << 19)
#define RTC_BKP         (1 << 18)
#define RTC_SUB1H       (1 << 17)
#define RTC_ADD1H       (1 << 16)
#define RTC_TSIE        (1 << 15)
#define RTC_WUTIE       (1 << 14)
#define RTC_ALRBIE      (1 << 13)
#define RTC_ALRAIE      (1 << 12)
#define RTC_TSE         (1 << 11)
#define RTC_WUTE        (1 << 10)
#define RTC_ALRBE       (1 << 9)
#define RTC_ALRAE       (1 << 8)
#define RTC_DCE         (1 << 7)
#define RTC_FMT         (1 << 6)
#define RTC_BYPSHAD     (1 << 5)
#define RTC_REFCKON     (1 << 4)
#define RTC_TSEDGE      (1 << 3)
#define RTC_WUCKSEL_DIV16           0
#define RTC_WUCKSEL_DIV8            1
#define RTC_WUCKSEL_DIV4            2
#define RTC_WUCKSEL_DIV2            3
#define RTC_WUCKSEL_CK_SPRE         4
#define RTC_WUCKSEL_CK_SPRE_ADDED   6

// ISR bits
#define RTC_TAMP2F      (1 << 14)
#define RTC_TAMP1F      (1 << 13)
#define RTC_TSOVF       (1 << 12)
#define RTC_TSF         (1 << 11)
#define RTC_WUTF        (1 << 10)
#define RTC_ALRBF       (1 << 9)
#define RTC_ALRAF       (1 << 8)
#define RTC_INIT        (1 << 7)
#define RTC_INITF       (1 << 6)
#define RTC_RSF         (1 << 5)
#define RTC_INITS       (1 << 4)
#define RTC_SHPF        (1 << 3)
#define RTC_WUTWF       (1 << 2)
#define RTC_ALRBWF      (1 << 1)
#define RTC_ALRAWF      (1 << 0)

// PRER bits
#define RTC_PREDIV_A(x) ((x) << 16)
#define RTC_PREDIV_S(x) ((x))

// CALIBR bits
#define RTC_DCS         (1 << 7)
#define RTC_DC(x)       ((x))

// ALRMAR, ALRMBR bits
#define RTC_ALRM_MSK4   (1 << 31)
#define RTC_ALRM_WDSEL  (1 << 30)
#define RTC_ALRM_DT(x)  ((x) << 28)
#define RTC_ALRM_DU(x)  ((x) << 24)
#define RTC_ALRM_MSK3   (1 << 23)
#define RTC_ALRM_PM     (1 << 22)
#define RTC_ALRM_HT(x)  ((x) << 20)
#define RTC_ALRM_HU(x)  ((x) << 16)
#define RTC_ALRM_MSK2   (1 << 15)
#define RTC_ALRM_MNT(x) ((x) << 12)
#define RTC_ALRM_MNU(x) ((x) << 8)
#define RTC_ALRM_MSK1   (1 << 7)
#define RTC_ALRM_ST(x)  ((x) << 4)
#define RTC_ALRM_SU(x)  ((x) << 0)

// SHIFTR bits
#define RTC_ADD1S       (1 << 31)
#define RTC_SUBFS(x)    ((x) << 0)

