alexrayne/uos-embedded/sources/runtime/cortex-m/io-stm32f2.h
// CALR bits
#define RTC_CALP        (1 << 15)
#define RTC_CALW8       (1 << 14)
#define RTC_CALW16      (1 << 13)
#define RTC_CALM(x)     (x)

// TAFCR bits
#define RTC_ALARMOUTTYPE    (1 << 18)
#define RTC_TSINSEL         (1 << 17)
#define RTC_TAMP1INSEL      (1 << 16)
#define RTC_TAMPPUDIS       (1 << 15)
#define RTC_TAMPPRCH(x)     ((x) << 13)
#define RTC_TAMPFLT(x)      ((x) << 11)
#define RTC_TAMPFREQ(x)     ((x) << 8)
#define RTC_TAMPTS          (1 << 7)
#define RTC_TAMP2TRG        (1 << 4)
#define RTC_TAMP2E          (1 << 3)
#define RTC_TAMPIE          (1 << 2)
#define RTC_TAMP1TRG        (1 << 1)
#define RTC_TAMP1E          (1 << 0)

// ALRMASSR, ALRMASSR bits
#define RTC_MASKSS(x)       ((x) << 24)
#define RTC_SS(x)           ((x) & 0x7FFF)


/////////////////////////////////////////
// Independent watchdog (IWDG)
/////////////////////////////////////////
typedef struct
{
    arm_reg_t KR;       // Key
    arm_reg_t DR;       // Prescaler
    arm_reg_t RLR;      // Reload
    arm_reg_t SR;      // Status
} IWDG_t;

#define IWDG   ((IWDG_t*) STM_IWDG_BASE)

// IWDG_KR bits
#define IWDG_ALIVE_KEY      0xAAAA
#define IWDG_ACCESS_KEY     0x5555
#define IWDG_START_KEY      0xCCCC

// IWDG_PR bits
#define IWDG_PR_DIV_4       0
#define IWDG_PR_DIV_8       1
#define IWDG_PR_DIV_16      2
#define IWDG_PR_DIV_32      3
#define IWDG_PR_DIV_64      4
#define IWDG_PR_DIV_128     5
#define IWDG_PR_DIV_256     6

// IWDG_SR bits
#define IWDG_RVU            (1 << 1)
#define IWDG_PVU            (1 << 0)


/////////////////////////////////////////
// Window watchdog (WWDG)
/////////////////////////////////////////
typedef struct
{
    arm_reg_t CR;       // Control
    arm_reg_t CFR;      // Configuration
    arm_reg_t ISR;      // Status
} WWDG_t;

#define WWDG   ((WWDG_t*) STM_WWDG_BASE)

// WWDG_CR bits
#define WWDG_WDGA           (1 << 7)
#define WWDG_T(n)           (n)

// WWDG_CFR bits
#define WWDG_EWI            (1 << 9)
#define WWDG_WDGTB_DIV_1    (0 << 7)
#define WWDG_WDGTB_DIV_2    (1 << 7)
#define WWDG_WDGTB_DIV_4    (2 << 7)
#define WWDG_WDGTB_DIV_8    (3 << 7)
#define WWDG_W(n)           (n)

// WWDG_SR bits
#define WWDG_EWIF           (1 << 0)


/////////////////////////////////////////
// SPI
/////////////////////////////////////////
typedef struct
{
    arm_reg_t CR1;      // Control 1
    arm_reg_t CR2;      // Control 2
    arm_reg_t SR;       // Status
    arm_reg_t DR;       // Data
    arm_reg_t CRCPR;    // CRC polynomial
    arm_reg_t RXCRCR;   // RX CRC
    arm_reg_t TXCRCR;   // TX CRC
    arm_reg_t I2SCFGR;  // I2S configuration
    arm_reg_t I2SPR;    // I2S prescaler
} SPI_t;

#define SPI1    ((SPI_t*) STM_SPI1_BASE)
#define SPI2    ((SPI_t*) STM_SPI2_I2S2_BASE)
#define SPI3    ((SPI_t*) STM_SPI3_I2S3_BASE)

// SPI_CR1 bits
#define SPI_BIDIMODE        (1 << 15)
#define SPI_BIDIOE          (1 << 14)
#define SPI_CRCEN           (1 << 13)
#define SPI_CRCNEXT         (1 << 12)
#define SPI_DFF             (1 << 11)
#define SPI_RXONLY          (1 << 10)
#define SPI_SSM             (1 << 9)
#define SPI_SSI             (1 << 8)
#define SPI_LSBFIRST        (1 << 7)
#define SPI_SPE             (1 << 6)
#define SPI_BR(x)           ((x) << 3)
#define SPI_MSTR            (1 << 2)
#define SPI_CPOL            (1 << 1)
#define SPI_CPHA            (1 << 0)

// SPI_CR2 bits
#define SPI_TXEIE           (1 << 7)
#define SPI_RXNEIE          (1 << 6)
#define SPI_ERRIE           (1 << 5)
#define SPI_FRF             (1 << 4)
#define SPI_SSOE            (1 << 2)
#define SPI_TXDMAEN         (1 << 1)
#define SPI_RXDMAEN         (1 << 0)

// SPI_SR bits
#define SPI_FRE             (1 << 8)
#define SPI_BSY             (1 << 7)
#define SPI_OVR             (1 << 6)
#define SPI_MODF            (1 << 5)
#define SPI_CRCERR          (1 << 4)
#define SPI_UDR             (1 << 3)
#define SPI_CHSIDE          (1 << 2)
#define SPI_TXE             (1 << 1)
#define SPI_RXNE            (1 << 0)

// SPI_I2SCFGR bits
#define SPI_I2SMOD              (1 << 11)
#define SPI_I2SE                (1 << 10)
#define SPI_I2SCFG_SLAVE_TX     (0 << 8)
#define SPI_I2SCFG_SLAVE_RX     (1 << 8)
#define SPI_I2SCFG_MASTER_TX    (2 << 8)
#define SPI_I2SCFG_MASTER_RX    (3 << 8)
#define SPI_PCMSYNC             (1 << 7)
#define SPI_I2SSTD_PHILIPS      (0 << 4)
#define SPI_I2SSTD_MSB_JUST     (1 << 4)
#define SPI_I2SSTD_LSB_JUST     (2 << 4)
#define SPI_I2SSTD_PCM          (3 << 4)
#define SPI_CKPOL               (1 << 3)
#define SPI_DATLEN_16BIT        (0 << 1)
#define SPI_DATLEN_24BIT        (1 << 1)
#define SPI_DATLEN_32BIT        (2 << 1)
#define SPI_CHLEN_16BIT         (0 << 0)
#define SPI_CHLEN_32BIT         (1 << 0)

// SPI_I2SPR bits
#define SPI_MCKOE           (1 << 9)
#define SPI_ODD             (1 << 8)
#define SPI_I2SDIV(x)       (x)

/////////////////////////////////////////
// CAN
/////////////////////////////////////////
typedef struct
{
    arm_reg_t IR;
    arm_reg_t DTR;
    arm_reg_t LR;
    arm_reg_t HR;
} CAN_mailbox_t;

typedef struct
{
    arm_reg_t R1;
    arm_reg_t R2;
} CAN_filter_t;

typedef struct
{
    arm_reg_t MCR;
    arm_reg_t MSR;
    arm_reg_t TSR;
    arm_reg_t RFxR[2];
    arm_reg_t IER;
    arm_reg_t ESR;
    arm_reg_t BTR;
    
    arm_reg_t reserved0[88];
    
    CAN_mailbox_t   TMB[3];
    CAN_mailbox_t   RMB[2];
    
    arm_reg_t reserved1[12];
    
    arm_reg_t FMR;
    arm_reg_t FM1R;
    
    arm_reg_t reserved2;
    
    arm_reg_t FS1R;
    
    arm_reg_t reserved3;
    
    arm_reg_t FFA1R;
    
    arm_reg_t reserved4;
    
    arm_reg_t FA1R;
    
    arm_reg_t reserved5;
    
    arm_reg_t reserved6[7];

    CAN_filter_t    FILT[14];
} CAN_t;

#define CAN1   ((CAN_t*) STM_CAN1_BASE)
#define CAN2   ((CAN_t*) STM_CAN2_BASE)

// MCR bits
#define CAN_DBF             (1 << 16)
#define CAN_RESET           (1 << 15)
#define CAN_TTCM            (1 << 7)
#define CAN_ABOM            (1 << 6)
#define CAN_AWUM            (1 << 5)
#define CAN_NART            (1 << 4)
#define CAN_RFLM            (1 << 3)
#define CAN_TXFP            (1 << 2)
#define CAN_SLEEP           (1 << 1)
#define CAN_INRQ            (1 << 0)

// MSR bits
#define CAN_RX              (1 << 11)
#define CAN_SAMP            (1 << 10)
#define CAN_RXM             (1 << 9)
#define CAN_TXM             (1 << 8)
#define CAN_SLAKI           (1 << 4)
#define CAN_WKUI            (1 << 3)
#define CAN_ERRI            (1 << 2)
#define CAN_SLAK            (1 << 1)
#define CAN_INAK            (1 << 0)

// TSR bits
#define CAN_LOW(n)          (1 << (29 + (n)))
#define CAN_TME(n)          (1 << (26 + (n)))
#define CAN_GET_CODE(r)     (((r) >> 24) & 0x3)
#define CAN_ABRQ(n)         (1 << (7 + 8 * (n)))
#define CAN_TERR(n)         (1 << (3 + 8 * (n)))
#define CAN_ALST(n)         (1 << (2 + 8 * (n)))
#define CAN_TXOK(n)         (1 << (1 + 8 * (n)))
#define CAN_RQCP(n)         (1 << (0 + 8 * (n)))

// RFxR bits
#define CAN_RFOM            (1 << 5)
#define CAN_FOVR            (1 << 4)
#define CAN_FULL            (1 << 3)
#define CAN_GET_FMP(r)      ((r) & 0x3)

