alexrayne/uos-embedded/sources/runtime/cortex-m/io-stm32f2.h
// IER bits
#define CAN_SLKIE           (1 << 17)
#define CAN_WKUIE           (1 << 16)
#define CAN_ERRIE           (1 << 15)
#define CAN_LECIE           (1 << 11)
#define CAN_BOFIE           (1 << 10)
#define CAN_EPVIE           (1 << 9)
#define CAN_EWGIE           (1 << 8)
#define CAN_FOVIE(n)        (1 << (3 + 3 * (n)))
#define CAN_FFIE(n)         (1 << (2 + 3 * (n)))
#define CAN_FMPIE(n)        (1 << (1 + 3 * (n)))
#define CAN_TMEIE           (1 << 0)

// ESR bits
#define CAN_GET_REC(r)      (((r) >> 24) & 0xFF)
#define CAN_GET_TEC(r)      (((r) >> 16) & 0xFF)
#define CAN_GET_LEC(r)      (((r) >> 4) & 0x7)
#define CAN_BOFF            (1 << 2)
#define CAN_EPVF            (1 << 1)
#define CAN_EWGF            (1 << 0)
// LEC field codes
#define CAN_LEC_NO_ERROR                0
#define CAN_LEC_STUFF_ERROR             1
#define CAN_LEC_FORM_ERROR              2
#define CAN_LEC_ACKNOWLEDGMENT_ERROR    3
#define CAN_LEC_BIT_RECESSIVE_ERROR     4
#define CAN_LEC_BIT_DOMINANT_ERROR      5
#define CAN_LEC_CRC_ERROR               6
#define CAN_LEC_RESET                   7

// BTR bits
#define CAN_SILM            (1 << 31)
#define CAN_LBKM            (1 << 30)
#define CAN_SJW(x)          ((x) << 24)
#define CAN_TS2(x)          ((x) << 20)
#define CAN_TS1(x)          ((x) << 16)
#define CAN_BRP(x)          ((x) << 0)

// Mailbox IR bits
#define CAN_STID(x)         ((x) << 21)
#define CAN_GET_STID(r)     (((r) >> 21) & 0x7FF)
#define CAN_EXID(x)         ((x) << 3)
#define CAN_GET_EXID(r)     (((r) >> 3) & 0x1FFFFFFF)
#define CAN_IDE             (1 << 2)
#define CAN_RTR             (1 << 1)
#define CAN_TXRQ            (1 << 0)

// Mailbox DTR bits
#define CAN_TIME(x)         ((x) << 16)
#define CAN_GET_TIME(r)     ((r) >> 16)
#define CAN_TGT             (1 << 8)
#define CAN_GET_FMI(r)      (((r) >> 8) & 0xFF)
#define CAN_DLC(x)          (x)
#define CAN_GET_DLC(r)      ((r) & 0xF)

// FMR bits
#define CAN_CAN2SB(x)       ((x) << 8)
#define CAN_FINIT           (1 << 0)

// FM1R bits
#define CAN_FBM(n)          (1 << (n))

// FS1R bits
#define CAN_FSC(n)          (1 << (n))

// FFA1R bits
#define CAN_FFA(n)          (1 << (n))

// FA1R bits
#define CAN_FACT(n)         (1 << (n))

